<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # google_service_account.main will be created
  + resource "google_service_account" "main" {
      + account_id   = "andrew-testing-buckets"
      + disabled     = false
      + display_name = "Andrew Testing (buckets)"
      + email        = "andrew-testing-buckets@regrello-app-development.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:andrew-testing-buckets@regrello-app-development.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "regrello-app-development"
      + unique_id    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + email = {
      + account_id                   = "andrew-testing-buckets"
      + create_ignore_already_exists = null
      + description                  = null
      + disabled                     = false
      + display_name                 = "Andrew Testing (buckets)"
      + email                        = "andrew-testing-buckets@regrello-app-development.iam.gserviceaccount.com"
      + id                           = (known after apply)
      + member                       = "serviceAccount:andrew-testing-buckets@regrello-app-development.iam.gserviceaccount.com"
      + name                         = (known after apply)
      + project                      = "regrello-app-development"
      + timeouts                     = null
      + unique_id                    = (known after apply)
    }

```
</details>